app/controllers/never_have_i_ever_controller.rb

  def random_NHIE
    nhie_id = rand(1..NeverHaveIEver.all.length)
    nhie = NeverHaveIEver.find(nhie_id)
---
SELECT "never_have_i_evers".* FROM "never_have_i_evers"
SELECT  "never_have_i_evers".* FROM "never_have_i_evers" WHERE "never_have_i_evers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]